Repository: TaitoUnited/full-stack-template
Catalog: client/src/locales/*/messages.po
Languages: fi

source: A minimal design system provides a set of UI kit components that adhere to certain design principles backed by a set of design tokens. This template defines a comprehensive set of design tokens for things like colors, typography, spacing, etc. in a globally available theme object. Additionally, the design system incorporates a UI kit that is browsable in Storybook.
fi: Minimaalinen design-systeemi tarjoaa kokoelman UI-komponentteja, jotka noudattavat tiettyjä design periaatteita nojaten erinäisiin design tokeneihin. Tässä templatessa on määritelty design tokenit esimerkiksi väreille, typografialle, ja tilalle globaalin teeman avulla. Lisäksi design-systeemi sisältää UI-komponentit, joita voi selailla Storybookin sisällä.

source: Accessibility
fi: Saavutettvasuus

source: Authentication
fi: Autentikaatio

source: Blog
fi: Blogi

source: Content
fi: Sisältö

source: Create
fi: Luo

source: Creating
fi: Luodaan

source: Dark Mode
fi: Tumma tila

source: Design System
fi: Design-systeemi

source: Email
fi: Sähköposti

source: Examples
fi: Esimerkit

source: Failed to add new blog post
fi: Blogikirjoituksen luominen epäonnistui

source: Features
fi: Ominaisuudet

source: Good accessibility is a something that should be expected from every app. The building blocks for creating accessible components are provided by React Aria. This template has pre-built UI kit components, such as Button, Text, TextInput, etc., that have accessibility baked into them. You can use and extend this UI kit to fit your needs.
fi: Riittävää saavutettavuutta tulisi vaatia jokaiselta sovellukselta. Tämän templaten saavutettavuuden legopalikat tarjoaa React Aria. Tässä templatessa on myös tarjolla UI-komponenttikirjasto, jossa on valmiiksi saavutettavia komponentteja, kuten Button, Text, ja TextInput. Voit vapaasti lisätä uusia komponentteja tai muokata olemassa olevia.

source: Having dark mode support is a common ask from users nowadays. This template has a ready-to-use theming setup with light and dark themes that can be easily modified to conform to the client's branding. Try to toggle the theme in the top right corner.
fi: Nykyaikana monet käyttäjät odottavat sovelluksen tukevan tummaa tilaa. Tässä templatessa on määriteltynä valmiiksi sekä vaalea että tumma teema, joita pystyy helposti muokkamaan sopimaan asikkaan brändiin. Yritä vaihta teemaa oikeasta yläkulmasta.

source: Home
fi: Koti

source: In the sidebar you can browse through some example pages. (TODO: add more examples)
fi: Sivuvalikosta voit selata erinäisiä esimerkkisivuja läpi. (TODO: lisää enemmän esimerkkejä)

source: Internationalization
fi: Kielistys

source: Logging in
fi: Kirjaudutaan sisään

source: Logging out
fi: Kirjaudutaan ulos

source: Login
fi: Kirjaudu sisään

source: Logout
fi: Kirjaudu ulos

source: Most apps will require internationalization at some point in their lifetime. This template the necessary setup for multiple languages that are loaded lazily once selected. Try changing the language in the top right corner.
fi: Useimmat sovellukset tarvitsevat kielistystä jossain vaiheessa elinkaartaan. Tämä template tarjoaa tarvittavan perustan laiskasti ladattaville kielistysmääritelmille. Yritä vaihtaa kieltä oikeasta yläkulmasta.

source: New blog post
fi: Uusi blogikirjoitus

source: New blog post added
fi: Uusi blogikirjoitus lisätty

source: No one likes looking at a blank screen. This template implements a traditional Single-Page-Application which means that the initial JS bundle has to downloaded before the app can render. A nice looking splash screen can be shown until the app is ready to render making the app loading UX more pleasant.
fi: Kukaan ei tykkää katsoa tyhjää ruutua. Tämä template toteuttaa perinteisen Single-Page-Application sovelluksen, missä sivuston alustava koodi täytyy ladata ennen kuin sovellus voidaan renderöidä. Hyvän näköinen aloitusruut parantaa käyttökokemusta, kun se näytetään tyhjän ruudun sijaan sillä aikaa, kun sovelluksen tarvitsema koodi latautuu.

source: Password
fi: Salasana

source: Practically every app needs to have a way to log in the user. This template provides a barebones authentication setup that should be extended to have a real way to log in the user either with a cookie or JWT based authentication method.
fi: Lähestulkoon jokainen sovellus tarvitsee tavan kirjata käyttäjän sisään sovellukseen. Tässä templatessa on valmiina yksinkertainen perusta autentikaatiolle, mitä täytyy jatkokehittää sovelluksen tarpeiden perusteella.

source: Report an error
fi: Raportoi virhe

source: Route Preloading
fi: Sivujen esilataus

source: Skeleton Placeholders
fi: Luurankosisältö

source: Speed is one of the most important aspects of a good UX. This template introduces a pattern for preloading route's data and code-split code in order to make page transitions feel instant.
fi: Nopeus on yksi tärkeimmistä osa-aluista hyvän käyttökokemuksen luomiseksi. Tämä template mahdollistaa sivujen ja niiden datan esilatauksen mahdollistaen erittäin nopealta tuntuvan sivun vaihdoksen

source: Spinners, so many spinners, everywhere. Traditional Single-Page-Applications usually show spinners while loading data for a given page. Instead of showing simple spinners this template offers a way to implement skeleton placeholders for pages with a cool shimmering effect.
fi: Spinnereitä, spinnereitä kaikkialla. Perinteiset Single-Page-Application sovellukset usein näyttävät latausindikaattoreita sillä aikaa, kun dataa ladataan, Tämä template tarjoaa mahdollisuuden näyttää ns. luurankosisältöä tylsien spinnereiden sijaan hienon shimmer efektin kera.

source: Splash Screen
fi: Aloitusruutu

source: Submit
fi: Lähetä

source: Theming
fi: Teemoitus

source: This React app contains the necessary building blocks that you need to get your project started. You can freely alter any aspect of the template to fit your needs better.
fi: Tämä React sovellus toimii alkupisteenä sovelluksesi kehittämiselle. Voit vapaasti muokata tätä templatea sopimaan paremmin omiin tarpeisiisi.

source: Welcome to Taito Fullstack Template!
fi: Tervetuloa Taito Fullstack Templateen
